ibrahim_folder/cases/fan_9/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    walls
    {
        type            wall;
        physicalType    wall;
        nFaces          5120;
        startFace       115744;
    }
    pressure_outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          1888;
        startFace       120864;
    }
    velocity_inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          1888;
        startFace       122752;
    }
)

// ************************************************************************* //
